add mermaid graaph
